function global:Watch-Task{
<#-----------------------------------------------------------------------------
[OverView]
-----------------------------------------------------------------------------#>
# 時間が来たらタスクのアラートをポップアップ画面を立ち上げて通知する。

<#-----------------------------------------------------------------------------
[1. Prepare]
-----------------------------------------------------------------------------#>
clear

<#-------------------------------------
[1-1. DefineVar]
-------------------------------------#>
if ($args[0]) {$task = $args[0]} else {$task = Read-Host "登録するタスク名"}
if ($args[1]) {$end = $args[1] + " " + $args[2]} else {$end = Read-Host "アラートを鳴らす時間(yyyy/mm/dd hh:mm:00)"}

$end + "まで『" + $task + "』タスクをWatch中！"
$message = "のタスクに取り掛かる時間！すぐに取り掛かる？"
$title = "HiroyaAlert"

<#-----------------------------------------------------------------------------
[2. GetSrc]
-----------------------------------------------------------------------------#>
<#-------------------------------------
[3. CustomData]
-------------------------------------#>
# 時間になるまで1分毎にWatch
do {
	$start = get-date
	$diff = New-TimeSpan $start $end
	sleep 1
} while ($diff.Ticks -gt 0)

<#-----------------------------------------------------------------------------
[4. PostDist]
-----------------------------------------------------------------------------#>
# 時間が来たらポップアップ立ち上げて通知
[System.Windows.Forms.MessageBox]::Show("$task$message","$title","YesNo","Information")
}
