<#-----------------------------------------------------------------------------
[OverView]
-----------------------------------------------------------------------------#>
<#
　ファイルサーバからファイルを取得する関数。
　　・引数1:サーバから取得するファイルのディレクトリ　例："H:\YourTeamPlace\WorkMaterial\"
　　・引数2:取得したファイルの置き場所ディレクトリ　例："C:Users\YourName\ProjectName\Src\"
　　・引数3(Option):サーバから取得するファイル(空欄の場合アスタリスク)
#>
<#-----------------------------------------------------------------------------
[1. Define]
-----------------------------------------------------------------------------#>
echo "GetFilesFromFS"
<#-------------------------------------
[1-1. 引数取得]
-------------------------------------#>
if ($args[0]) {$SrcDir = $args[0]} else {"取得したいファイルディレクトリを渡して下さい。";exit}
if ($args[1]) {$DistDir = $args[1]} else {$DistDir = Read-Host "取得先の置き場所を指定して下さい。"}
if ($args[2]) {$SrcFile = $args[2]} else {$SrcFile = "*"}

<#-------------------------------------
[1-2. ディレクトリ定義]
-------------------------------------#>
# 最後方文字列が\マークで無ければ付け足す
if (-not ($SrcDir.Substring($SrcDir.Length-1,1) -eq "\")) {$SrcDir = $SrcDir + "\"}
if (-not ($DistDir.Substring($DistDir.Length-1,1) -eq "\")) {$DistDir = $DistDir + "\"}

<#-------------------------------------
[1-3. 誤操作チェック]
-------------------------------------#>
# Post禁止！Cドライブ以外にコピーしようとしていたら操作終了。
if (-not ($DistDir.Substring(0,2) -eq "C:")) {"Cドライブ以外にコピー禁止！";exit}

<#-----------------------------------------------------------------------------
[2. GetSrc]
-----------------------------------------------------------------------------#>
Copy-Item $SrcDir$SrcFile $DistDir

exit
