function global:XLSFileToCSVFile{

<#-----------------------------------------------------------------------------
[OverView]
-----------------------------------------------------------------------------#>
<#
　XLSファイルを開いてCSV保存する関数。
　　・引数1:取得するCSVファイルの絶対パス
　　・引数2:保存したいCSVFileのファイル名
　　・引数3:ヘッダから数えて削除する行数指定
　　・引数4:ヘッダから数えて削除する列数指定

#>
<#-----------------------------------------------------------------------------
[1. Define]
-----------------------------------------------------------------------------#>
<#-------------------------------------
[1-1. 引数取得]
-------------------------------------#>
if ($args[0]) {$XLSFile = $args[0]} else {$XLSFile = Read-Host "取得するXLSFileの絶対パスを入力して下さい。"}
if ($args[1]) {$SheetName = $args[1]} else {$SheetName = Read-Host "取得するXLSFileのシート名を入力して下さい。"}
if ($args[2]) {$CSVFile = $args[2]} else {$CSVFile = Read-Host "保存するCSVFileのファイル名を入力して下さい。"}

<#-----------------------------------------------------------------------------
[2. GetSrc]
-----------------------------------------------------------------------------#>
<#-------------------------------------
[2-1. 読み込み元エクセルファイル取得]
-------------------------------------#>
$excel = New-Object -ComObject Excel.Application
$excel.Visible = $false 
$excel.DisplayAlerts = $false

#エクセルを開く
$book = $excel.Workbooks.Open((Convert-path $XLSFile))

<#-------------------------------------
[2-2. 読み込み元エクセルシート取得]
-------------------------------------#>
#シート名取り出し
$sheet = $book.Worksheets.Item($SheetName)
$sheet.Activate()

<#-------------------------------------
[3-1. ヘッダから数えて削除する行数指定]
-------------------------------------#>
#削除する行数が指定されていたらヘッダから数えて余計な行を削除
#if ($DelLine) {$count =1;while($count -le $DelLine){$sheet.Rows.item(1).Delete();$count++;}

<#-------------------------------------
[3-2. ヘッダから数えて削除する列数指定]
-------------------------------------#>
#削除する列数が指定されていたらヘッダから数えて余計な列を削除
#if ($DelRow) {$count =1;while($count -le $DelRow){$sheet.Columns.item(1).Delete();$count++;}

<#-----------------------------------------------------------------------------
[4. PostDist]
-----------------------------------------------------------------------------#>
<#-------------------------------------
[4-1. Outputファイル出力]
-------------------------------------#>
#Excelを同じフォルダに新規CSV保存する
$book.SaveAs((Split-Path(Convert-Path $XLSFile) -parent) + "\" + $CSVFile,6)

<#-----------------------------------------------------------------------------
[5. Clean]
-----------------------------------------------------------------------------#>
<#-------------------------------------
[5-1. Excelを閉じる]
-------------------------------------#>
$excel.Quit();$excel = $null
}

